In [65]:
import pandas as pd

In [66]:
#loading the data from dataset
df = pd.read_csv("../data/uber_data_final.csv")

/var/folders/dm/v38qp4yn217b0s787gmbqf2m0000gn/T/ipykernel_2041/905787347.py:2: DtypeWarning: Columns (22,23) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("../data/uber_data_final.csv")

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999999 entries, 0 to 999998
Data columns (total 24 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   Unnamed: 0             999999 non-null  int64
 1   VendorID               999999 non-null  int64
 2   tpep_pickup_datetime   999999 non-null  object
 3   tpep_dropoff_datetime  999999 non-null  object
 4   passenger_count        999999 non-null  float64
 5   trip_distance          999999 non-null  float64
 6   RatecodeID             999999 non-null  float64
 7   store_and_fwd_flag     999999 non-null  object
 8   PULocationID           999999 non-null  int64
 9   DOLocationID           999999 non-null  int64
 10  payment_type           999999 non-null  int64
 11  fare_amount            999999 non-null  float64
 12  extra                  999999 non-null  float64
 13  mta_tax                999999 non-null  float64
 14  tip_amount             999999 non-null  float64
 15  tolls_amount           999999 non-null  float64
 16  improvement_surcharge  999999 non-null  float64
 17  total_amount           999999 non-null  float64
 18  congestion_surcharge   999999 non-null  float64
 19  airport_fee            999999 non-null  float64
 20  pickup_longitude       100000 non-null  float64
 21  pickup_latitude        100000 non-null  float64
 22  dropoff_longitude      999999 non-null  object
 23  dropoff_latitude       999999 non-null  object
dtypes: float64(14), int64(5), object(5)
memory usage: 183.1+ MB

In [68]:
df['trip_id'] = df.index

In [69]:
df.head()

,Unnamed: 0,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,...,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge,airport_fee,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,trip_id
0,0,2,2023-01-01 00:32:10,2023-01-01 00:40:36,1.0,0.97,1.0,N,161,141,...,0.0,1.0,14.30,2.5,0.00,-73.976746,40.765152,-74.004265,40.746128,0
1,1,2,2023-01-01 00:55:08,2023-01-01 01:01:27,1.0,1.10,1.0,N,43,237,...,0.0,1.0,16.90,2.5,0.00,-73.983482,40.767925,-74.005943,40.733166,1
2,2,2,2023-01-01 00:25:04,2023-01-01 00:37:49,1.0,2.51,1.0,N,48,238,...,0.0,1.0,34.90,2.5,0.00,-73.782021,40.644810,-73.974541,40.67577,2
3,3,1,2023-01-01 00:03:48,2023-01-01 00:13:25,0.0,1.90,1.0,N,138,7,...,0.0,1.0,20.85,0.0,1.25,-73.863419,40.769814,-73.96965,40.757767,3
4,4,2,2023-01-01 00:10:29,2023-01-01 00:21:19,1.0,1.43,1.0,N,107,79,...,0.0,1.0,19.68,2.5,0.00,-73.971741,40.792183,-74.17717,40.695053,4

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999999 entries, 0 to 999998
Data columns (total 25 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   Unnamed: 0             999999 non-null  int64
 1   VendorID               999999 non-null  int64
 2   tpep_pickup_datetime   999999 non-null  object
 3   tpep_dropoff_datetime  999999 non-null  object
 4   passenger_count        999999 non-null  float64
 5   trip_distance          999999 non-null  float64
 6   RatecodeID             999999 non-null  float64
 7   store_and_fwd_flag     999999 non-null  object
 8   PULocationID           999999 non-null  int64
 9   DOLocationID           999999 non-null  int64
 10  payment_type           999999 non-null  int64
 11  fare_amount            999999 non-null  float64
 12  extra                  999999 non-null  float64
 13  mta_tax                999999 non-null  float64
 14  tip_amount             999999 non-null  float64
 15  tolls_amount           999999 non-null  float64
 16  improvement_surcharge  999999 non-null  float64
 17  total_amount           999999 non-null  float64
 18  congestion_surcharge   999999 non-null  float64
 19  airport_fee            999999 non-null  float64
 20  pickup_longitude       100000 non-null  float64
 21  pickup_latitude        100000 non-null  float64
 22  dropoff_longitude      999999 non-null  object
 23  dropoff_latitude       999999 non-null  object
 24  trip_id                999999 non-null  int64
dtypes: float64(14), int64(6), object(5)
memory usage: 190.7+ MB

In [71]:
#converting the pickupdatetime and dropofftime from object to datatime
df['tpep_pickup_datetime'] = pd.to_datetime(df['tpep_pickup_datetime'])
df['tpep_dropoff_datetime'] = pd.to_datetime(df['tpep_dropoff_datetime'])

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999999 entries, 0 to 999998
Data columns (total 25 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   Unnamed: 0             999999 non-null  int64
 1   VendorID               999999 non-null  int64
 2   tpep_pickup_datetime   999999 non-null  datetime64[ns]
 3   tpep_dropoff_datetime  999999 non-null  datetime64[ns]
 4   passenger_count        999999 non-null  float64
 5   trip_distance          999999 non-null  float64
 6   RatecodeID             999999 non-null  float64
 7   store_and_fwd_flag     999999 non-null  object
 8   PULocationID           999999 non-null  int64
 9   DOLocationID           999999 non-null  int64
 10  payment_type           999999 non-null  int64
 11  fare_amount            999999 non-null  float64
 12  extra                  999999 non-null  float64
 13  mta_tax                999999 non-null  float64
 14  tip_amount             999999 non-null  float64
 15  tolls_amount           999999 non-null  float64
 16  improvement_surcharge  999999 non-null  float64
 17  total_amount           999999 non-null  float64
 18  congestion_surcharge   999999 non-null  float64
 19  airport_fee            999999 non-null  float64
 20  pickup_longitude       100000 non-null  float64
 21  pickup_latitude        100000 non-null  float64
 22  dropoff_longitude      999999 non-null  object
 23  dropoff_latitude       999999 non-null  object
 24  trip_id                999999 non-null  int64
dtypes: datetime64[ns](2), float64(14), int64(6), object(3)
memory usage: 190.7+ MB

In [73]:
#removing the duplicates in dataframes and transforming them into the table
datetime_dim = df[['tpep_pickup_datetime', 'tpep_dropoff_datetime']].drop_duplicates().reset_index(drop=True)
datetime_dim['tpep_pickup_datetime'] = datetime_dim['tpep_pickup_datetime']
datetime_dim['pick_hour'] = datetime_dim['tpep_pickup_datetime'].dt.hour
datetime_dim['pick_day'] = datetime_dim['tpep_pickup_datetime'].dt.day
datetime_dim['pick_month'] = datetime_dim['tpep_pickup_datetime'].dt.month
datetime_dim['pick_year'] = datetime_dim['tpep_pickup_datetime'].dt.year
datetime_dim['pick_weekday'] = datetime_dim['tpep_pickup_datetime'].dt.weekday

datetime_dim['tpep_dropoff_datetime'] = datetime_dim['tpep_dropoff_datetime']
datetime_dim['drop_hour'] = datetime_dim['tpep_dropoff_datetime'].dt.hour
datetime_dim['drop_day'] = datetime_dim['tpep_dropoff_datetime'].dt.day
datetime_dim['drop_month'] = datetime_dim['tpep_dropoff_datetime'].dt.month
datetime_dim['drop_year'] = datetime_dim['tpep_dropoff_datetime'].dt.year
datetime_dim['drop_weekday'] = datetime_dim['tpep_dropoff_datetime'].dt.weekday

In [74]:
datetime_dim

,tpep_pickup_datetime,tpep_dropoff_datetime,pick_hour,pick_day,pick_month,pick_year,pick_weekday,drop_hour,drop_day,drop_month,drop_year,drop_weekday
0,2023-01-01 00:32:10,2023-01-01 00:40:36,0,1,1,2023,6,0,1,1,2023,6
1,2023-01-01 00:55:08,2023-01-01 01:01:27,0,1,1,2023,6,1,1,1,2023,6
2,2023-01-01 00:25:04,2023-01-01 00:37:49,0,1,1,2023,6,0,1,1,2023,6
3,2023-01-01 00:03:48,2023-01-01 00:13:25,0,1,1,2023,6,0,1,1,2023,6
4,2023-01-01 00:10:29,2023-01-01 00:21:19,0,1,1,2023,6,0,1,1,2023,6
...,...,...,...,...,...,...,...,...,...,...,...,...
990838,2023-01-12 08:26:34,2023-01-12 08:44:12,8,12,1,2023,3,8,12,1,2023,3
990839,2023-01-12 08:44:15,2023-01-12 09:39:58,8,12,1,2023,3,9,12,1,2023,3
990840,2023-01-12 08:20:16,2023-01-12 08:26:09,8,12,1,2023,3,8,12,1,2023,3
990841,2023-01-12 09:01:08,2023-01-12 09:09:41,9,12,1,2023,3,9,12,1,2023,3
990842,2023-01-12 08:58:14,2023-01-12 09:07:32,8,12,1,2023,3,9,12,1,2023,3

In [75]:
#check in the index's
datetime_dim.index

RangeIndex(start=0, stop=990843, step=1)

In [76]:
# adding primary key(datetime_id) to the datetime_dim table
datetime_dim['datetime_id'] = datetime_dim.index

In [77]:
datetime_dim

,tpep_pickup_datetime,tpep_dropoff_datetime,pick_hour,pick_day,pick_month,pick_year,pick_weekday,drop_hour,drop_day,drop_month,drop_year,drop_weekday,datetime_id
0,2023-01-01 00:32:10,2023-01-01 00:40:36,0,1,1,2023,6,0,1,1,2023,6,0
1,2023-01-01 00:55:08,2023-01-01 01:01:27,0,1,1,2023,6,1,1,1,2023,6,1
2,2023-01-01 00:25:04,2023-01-01 00:37:49,0,1,1,2023,6,0,1,1,2023,6,2
3,2023-01-01 00:03:48,2023-01-01 00:13:25,0,1,1,2023,6,0,1,1,2023,6,3
4,2023-01-01 00:10:29,2023-01-01 00:21:19,0,1,1,2023,6,0,1,1,2023,6,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...
990838,2023-01-12 08:26:34,2023-01-12 08:44:12,8,12,1,2023,3,8,12,1,2023,3,990838
990839,2023-01-12 08:44:15,2023-01-12 09:39:58,8,12,1,2023,3,9,12,1,2023,3,990839
990840,2023-01-12 08:20:16,2023-01-12 08:26:09,8,12,1,2023,3,8,12,1,2023,3,990840
990841,2023-01-12 09:01:08,2023-01-12 09:09:41,9,12,1,2023,3,9,12,1,2023,3,990841
990842,2023-01-12 08:58:14,2023-01-12 09:07:32,8,12,1,2023,3,9,12,1,2023,3,990842

In [78]:
#arranging in proper order
datetime_dim = datetime_dim[['datetime_id', 'tpep_pickup_datetime', 'pick_hour', 'pick_day', 'pick_month', 'pick_year', 'pick_weekday',
                             'tpep_dropoff_datetime', 'drop_hour', 'drop_day', 'drop_month', 'drop_year', 'drop_weekday']]

In [79]:
datetime_dim.head()

,datetime_id,tpep_pickup_datetime,pick_hour,pick_day,pick_month,pick_year,pick_weekday,tpep_dropoff_datetime,drop_hour,drop_day,drop_month,drop_year,drop_weekday
0,0,2023-01-01 00:32:10,0,1,1,2023,6,2023-01-01 00:40:36,0,1,1,2023,6
1,1,2023-01-01 00:55:08,0,1,1,2023,6,2023-01-01 01:01:27,1,1,1,2023,6
2,2,2023-01-01 00:25:04,0,1,1,2023,6,2023-01-01 00:37:49,0,1,1,2023,6
3,3,2023-01-01 00:03:48,0,1,1,2023,6,2023-01-01 00:13:25,0,1,1,2023,6
4,4,2023-01-01 00:10:29,0,1,1,2023,6,2023-01-01 00:21:19,0,1,1,2023,6

In [80]:
# creating passenger_count dim table
passenger_count_dim = df[['passenger_count']].reset_index(drop=True) #droping duplicates
passenger_count_dim['passenger_count_id'] = passenger_count_dim.index
passenger_count_dim = passenger_count_dim[['passenger_count_id','passenger_count']]

In [81]:
# creating trip_distance dim table
trip_distance_dim = df[['trip_distance']].reset_index(drop=True) #droping duplicates
trip_distance_dim['trip_distance_id'] = trip_distance_dim.index
trip_distance_dim = trip_distance_dim[['trip_distance_id','trip_distance']]

In [82]:
passenger_count_dim.head()

   passenger_count_id  passenger_count
0                   0              1.0
1                   1              1.0
2                   2              1.0
3                   3              0.0
4                   4              1.0

In [83]:
trip_distance_dim.head()

   trip_distance_id  trip_distance
0                 0           0.97
1                 1           1.10
2                 2           2.51
3                 3           1.90
4                 4           1.43

In [84]:
# created dictionary based on the yellow taxi dict
rate_code_type = {
    1:"Standard rate",
    2:"JFK",
    3:"Newark",
    4:"Nassau or Westchester",
    5:"Negotiated fare",
    6:"Group ride"
}

# creating the rate_code dim table
rate_code_dim = df[['RatecodeID']].reset_index(drop=True)
rate_code_dim['rate_code_id'] = rate_code_dim.index
rate_code_dim['rate_code_name'] = rate_code_dim['RatecodeID'].map(rate_code_type)
rate_code_dim = rate_code_dim[['rate_code_id','RatecodeID','rate_code_name']]

In [85]:
rate_code_dim.head()

   rate_code_id  RatecodeID rate_code_name
0             0         1.0  Standard rate
1             1         1.0  Standard rate
2             2         1.0  Standard rate
3             3         1.0  Standard rate
4             4         1.0  Standard rate

In [86]:
#creating pickup_location dim table
pickup_location_dim = df[['pickup_longitude', 'pickup_latitude']].reset_index(drop=True)
pickup_location_dim['pickup_location_id'] = pickup_location_dim.index
pickup_location_dim = pickup_location_dim[['pickup_location_id','pickup_latitude','pickup_longitude']]

In [87]:
dropoff_location_dim = df[['dropoff_longitude', 'dropoff_latitude']].reset_index(drop=True)
dropoff_location_dim['dropoff_location_id'] = dropoff_location_dim.index
dropoff_location_dim = dropoff_location_dim[['dropoff_location_id','dropoff_latitude','dropoff_longitude']]

In [88]:
payment_type_name = {
    1:"Credit card",
    2:"Cash",
    3:"No charge",
    4:"Dispute",
    5:"Unknown",
    6:"Voided trip"
}
payment_type_dim = df[['payment_type']].reset_index(drop=True)
payment_type_dim['payment_type_id'] = payment_type_dim.index
payment_type_dim['payment_type_name'] = payment_type_dim['payment_type'].map(payment_type_name)
payment_type_dim = payment_type_dim[['payment_type_id','payment_type','payment_type_name']]

In [89]:
payment_type_dim.head()

   payment_type_id  payment_type payment_type_name
0                0             2              Cash
1                1             1       Credit card
2                2             1       Credit card
3                3             1       Credit card
4                4             1       Credit card

In [90]:
fact_table = df.merge(passenger_count_dim, left_on='trip_id', right_on='passenger_count_id') \
             .merge(trip_distance_dim, left_on='trip_id', right_on='trip_distance_id') \
             .merge(rate_code_dim, left_on='trip_id', right_on='rate_code_id') \
             .merge(pickup_location_dim, left_on='trip_id', right_on='pickup_location_id') \
             .merge(dropoff_location_dim, left_on='trip_id', right_on='dropoff_location_id')\
             .merge(datetime_dim, left_on='trip_id', right_on='datetime_id') \
             .merge(payment_type_dim, left_on='trip_id', right_on='payment_type_id') \
             [['trip_id','VendorID', 'datetime_id', 'passenger_count_id',
               'trip_distance_id', 'rate_code_id', 'store_and_fwd_flag', 'pickup_location_id', 'dropoff_location_id',
               'payment_type_id', 'fare_amount', 'extra', 'mta_tax', 'tip_amount', 'tolls_amount',
               'improvement_surcharge', 'total_amount']]

In [91]:
fact_table.head()

,trip_id,VendorID,datetime_id,passenger_count_id,trip_distance_id,rate_code_id,store_and_fwd_flag,pickup_location_id,dropoff_location_id,payment_type_id,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,0,2,0,0,0,0,N,0,0,0,9.3,1.00,0.5,0.00,0.0,1.0,14.30
1,1,2,1,1,1,1,N,1,1,1,7.9,1.00,0.5,4.00,0.0,1.0,16.90
2,2,2,2,2,2,2,N,2,2,2,14.9,1.00,0.5,15.00,0.0,1.0,34.90
3,3,1,3,3,3,3,N,3,3,3,12.1,7.25,0.5,0.00,0.0,1.0,20.85
4,4,2,4,4,4,4,N,4,4,4,11.4,1.00,0.5,3.28,0.0,1.0,19.68

In [92]:
payment_type_dim.columns

Index(['payment_type_id', 'payment_type', 'payment_type_name'], dtype='object')

In [93]:
fact_table.columns

Index(['trip_id', 'VendorID', 'datetime_id', 'passenger_count_id',
       'trip_distance_id', 'rate_code_id', 'store_and_fwd_flag',
       'pickup_location_id', 'dropoff_location_id', 'payment_type_id',
       'fare_amount', 'extra', 'mta_tax', 'tip_amount', 'tolls_amount',
       'improvement_surcharge', 'total_amount'],
      dtype='object')

In [94]:
fact_table

,trip_id,VendorID,datetime_id,passenger_count_id,trip_distance_id,rate_code_id,store_and_fwd_flag,pickup_location_id,dropoff_location_id,payment_type_id,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,0,2,0,0,0,0,N,0,0,0,9.3,1.00,0.5,0.00,0.0,1.0,14.30
1,1,2,1,1,1,1,N,1,1,1,7.9,1.00,0.5,4.00,0.0,1.0,16.90
2,2,2,2,2,2,2,N,2,2,2,14.9,1.00,0.5,15.00,0.0,1.0,34.90
3,3,1,3,3,3,3,N,3,3,3,12.1,7.25,0.5,0.00,0.0,1.0,20.85
4,4,2,4,4,4,4,N,4,4,4,11.4,1.00,0.5,3.28,0.0,1.0,19.68
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
990838,990838,2,990838,990838,990838,990838,N,990838,990838,990838,8.6,0.00,0.5,3.15,0.0,1.0,15.75
990839,990839,1,990839,990839,990839,990839,Y,990839,990839,990839,5.8,2.50,0.5,0.00,0.0,1.0,9.80
990840,990840,1,990840,990840,990840,990840,N,990840,990840,990840,22.6,2.50,0.5,2.00,0.0,1.0,28.60
990841,990841,1,990841,990841,990841,990841,N,990841,990841,990841,65.3,1.25,0.5,5.00,0.0,1.0,73.05
990842,990842,2,990842,990842,990842,990842,N,990842,990842,990842,6.5,0.00,0.5,2.10,0.0,1.0,12.60